var express = require('express');
var path = require('path');
var favicon = require('serve-favicon');
var logger = require('morgan');
var cookieParser = require('cookie-parser');
var bodyParser = require('body-parser');
var find = require('./public/javascripts/find.js');
var index = require('./routes/index');
var users = require('./routes/users');

var app = express();
app.use(express.static(path.join(__dirname, 'music')));

app.get('/all', function(req, res) {
    res.header("Access-Control-Allow-Origin", "*");
    console.log("aaaaaaaa")
    find.findByConditions();
    res.send([{
        "_id" : "59f19ce01d96141cd96231ce",
        "name" : "轨迹",
        "artist" : "周杰伦",
        "duration" : "05:26",
        "filename":"static/music/1.mp3",
        "lrc":"[00:06.00]周杰伦\n" +
        "[00:10.00]\n" +
        "[00:14.00]\n" +
        "[00:18.68]怎么隐藏我的悲伤\n" +
        "[00:24.70]失去你的地方\n" +
        "[00:31.11]你的发香散得匆忙\n" +
        "[00:37.44]我已经跟不上\n" +
        "[00:43.91]闭上眼睛还能看见\n" +
        "[00:50.22]你离去的痕迹\n" +
        "[00:56.61]在月光下一直找寻\n" +
        "[01:03.08]那想念的身影\n" +
        "[01:09.73]如果说分手是苦痛的起点\n" +
        "[01:15.42]那在终点之前我愿意再爱一遍\n" +
        "[01:22.39]想要对你说的不敢说的爱\n" +
        "[01:28.54]会不会有人可以明白\n" +
        "[01:34.81]我会发着呆然后忘记你\n" +
        "[01:41.20]接着紧紧闭上眼\n" +
        "[01:47.51]想着那一天会有人代替\n" +
        "[01:54.31]让我不再想念你\n" +
        "[02:00.16]我会发着呆然后微微笑\n" +
        "[02:06.51]接着紧紧闭上眼\n" +
        "[02:12.78]又想那一年你温柔的脸\n" +
        "[02:19.74]在我忘记之前\n" +
        "[02:26.03]\n",
        "poster":"http://a1.att.hudong.com/08/13/300000569933126924135297200.jpg"
    },{
        "_id" : "2222222222222222222",
        "name" : "断了的弦",
        "artist" : "周杰伦",
        "duration" : "04:57",
        "filename":"static/music/2.mp3",
        "lrc":"[00:18.200]断了的弦 再怎么连\n" +
        "[00:23.450]我的感觉你已听不见\n" +
        "[00:28.220]你的转变像断掉的弦\n" +
        "[00:33.180]再怎么接 音都不对\n" +
        "[00:36.480]你的改变我能够分辨\n" +
        "[00:39.640]我沉默 你的话也不多\n" +
        "[00:44.240]我们之间少了什么不说\n" +
        "[00:48.240]哎唷~微笑后表情终于有点难过 （握着你的手）\n" +
        "[00:54.370]问你 确定了再走\n" +
        "[00:59.360]我突然释怀的笑\n" +
        "[01:01.850]笑声盘旋半山腰\n" +
        "[01:04.310]随风在飘摇啊摇\n" +
        "[01:06.720]来到你的面前绕\n" +
        "[01:09.230]你泪水往下的掉\n" +
        "[01:11.650]说会记住我的好\n" +
        "[01:14.230]我也弯起了嘴角笑\n" +
        "[01:19.150]你的美已经给了谁\n" +
        "[01:23.570]追了又追我要不回\n" +
        "[01:29.120]我了解离开树的叶\n" +
        "[01:33.400]属于地上的世界凋谢\n" +
        "[01:40.210]断了的弦再弹一遍\n" +
        "[01:45.050]我的世界你不在里面\n" +
        "[01:49.620]我的指尖已经弹出茧\n" +
        "[01:54.410]还是无法留你在我身边\n" +
        "[01:59.520]断了的弦 再怎么连\n" +
        "[02:04.340]我的感觉你已听不见\n" +
        "[02:09.730]你的转变像断掉的弦\n" +
        "[02:14.300]再怎么接 音都不对\n" +
        "[02:17.990]你的改变我能够分辨\n" +
        "[02:30.940]我沉默 你的话也不多\n" +
        "[02:35.530]我们之间少了什么不说\n" +
        "[02:39.500]哎唷~微笑后表情终于有点难过 （握着你的手）\n" +
        "[02:45.760]问你 确定了再走\n" +
        "[02:50.800]我突然释怀的笑\n" +
        "[02:53.130]笑声盘旋半山腰\n" +
        "[02:55.670]随风在飘摇啊摇\n" +
        "[02:58.080]来到你的面前绕\n" +
        "[03:00.520]你泪水往下的掉\n" +
        "[03:03.050]说会记住我的好\n" +
        "[03:05.570]我也弯起了嘴角笑\n" +
        "[03:10.450]你的美已经给了谁\n" +
        "[03:14.890]追了又追我要不回\n" +
        "[03:20.390]我了解离开树的叶\n" +
        "[03:24.710]属于地上的世界凋谢\n" +
        "[03:31.480]断了的弦再弹一遍\n" +
        "[03:36.460]我的世界你不在里面\n" +
        "[03:41.310]我的指尖已经弹出茧\n" +
        "[03:46.130]还是无法留你在我身边\n" +
        "[03:51.100]断了的弦 再怎么连\n" +
        "[03:56.220]我的感觉你已听不见\n" +
        "[04:01.200]你的转变像断掉的弦\n" +
        "[04:05.950]再怎么接 音都不对\n" +
        "[04:09.240]你的改变我能够分辨",
        "poster":"http://a1.att.hudong.com/08/13/300000569933126924135297200.jpg"
    },{
        "_id" : "33333",
        "name" : "告白气球",
        "artist" : "周杰伦",
        "duration" : "04:57",
        "filename":"static/music/2.mp3",
        "lrc":"[00:18.200]断了的弦 再怎么连\n" +
        "[00:23.450]我的感觉你已听不见\n" +
        "[00:28.220]你的转变像断掉的弦\n" +
        "[00:33.180]再怎么接 音都不对\n" +
        "[00:36.480]你的改变我能够分辨\n" +
        "[00:39.640]我沉默 你的话也不多\n" +
        "[00:44.240]我们之间少了什么不说\n" +
        "[00:48.240]哎唷~微笑后表情终于有点难过 （握着你的手）\n" +
        "[00:54.370]问你 确定了再走\n" +
        "[00:59.360]我突然释怀的笑\n" +
        "[01:01.850]笑声盘旋半山腰\n" +
        "[01:04.310]随风在飘摇啊摇\n" +
        "[01:06.720]来到你的面前绕\n" +
        "[01:09.230]你泪水往下的掉\n" +
        "[01:11.650]说会记住我的好\n" +
        "[01:14.230]我也弯起了嘴角笑\n" +
        "[01:19.150]你的美已经给了谁\n" +
        "[01:23.570]追了又追我要不回\n" +
        "[01:29.120]我了解离开树的叶\n" +
        "[01:33.400]属于地上的世界凋谢\n" +
        "[01:40.210]断了的弦再弹一遍\n" +
        "[01:45.050]我的世界你不在里面\n" +
        "[01:49.620]我的指尖已经弹出茧\n" +
        "[01:54.410]还是无法留你在我身边\n" +
        "[01:59.520]断了的弦 再怎么连\n" +
        "[02:04.340]我的感觉你已听不见\n" +
        "[02:09.730]你的转变像断掉的弦\n" +
        "[02:14.300]再怎么接 音都不对\n" +
        "[02:17.990]你的改变我能够分辨\n" +
        "[02:30.940]我沉默 你的话也不多\n" +
        "[02:35.530]我们之间少了什么不说\n" +
        "[02:39.500]哎唷~微笑后表情终于有点难过 （握着你的手）\n" +
        "[02:45.760]问你 确定了再走\n" +
        "[02:50.800]我突然释怀的笑\n" +
        "[02:53.130]笑声盘旋半山腰\n" +
        "[02:55.670]随风在飘摇啊摇\n" +
        "[02:58.080]来到你的面前绕\n" +
        "[03:00.520]你泪水往下的掉\n" +
        "[03:03.050]说会记住我的好\n" +
        "[03:05.570]我也弯起了嘴角笑\n" +
        "[03:10.450]你的美已经给了谁\n" +
        "[03:14.890]追了又追我要不回\n" +
        "[03:20.390]我了解离开树的叶\n" +
        "[03:24.710]属于地上的世界凋谢\n" +
        "[03:31.480]断了的弦再弹一遍\n" +
        "[03:36.460]我的世界你不在里面\n" +
        "[03:41.310]我的指尖已经弹出茧\n" +
        "[03:46.130]还是无法留你在我身边\n" +
        "[03:51.100]断了的弦 再怎么连\n" +
        "[03:56.220]我的感觉你已听不见\n" +
        "[04:01.200]你的转变像断掉的弦\n" +
        "[04:05.950]再怎么接 音都不对\n" +
        "[04:09.240]你的改变我能够分辨",
        "poster":"http://a1.att.hudong.com/08/13/300000569933126924135297200.jpg"
    }]);
});
app.listen(8081,"127.0.0.1",function () {
    console.log("open")
})
// module.exports = app;
